Repository: schooltool-project/schooltool.cando
Catalog: src/schooltool/cando/locales/*.po
Languages: th

source: Skills
th: ทักษะความรู้

source: Skill Sets
th: กลุ่มทักษะ

source: Layers
th: ชั้นงาน

source: Nodes
th: โหนด

source: Add
th: เพิ่ม

source: Actions
th: การดำเนินการ

source: Skill Set
th: กลุ่มทักษะ

source: New Skill Set
th: เพิ่มกลุ่มทักษะ

source: Edit
th: แก้ไข

source: Skill
th: ทักษะความรู้

source: New Skill
th: เพิ่มทักษะใหม่

source: View Skill
th: เรียกดูทักษะ

source: Assigned Skills
th: ทักษะที่ระบุ

source: Assign Skills
th: ระบุทักษะ

source: Remove Skills
th: ลบทักษะ

source: Set Required/Visible
th: ตั้งเป็นต้องมี/สามารถมองเห็น

source: Assign Skill Set
th: ระบุกลุ่มทักษะ

source: Edit Skills
th: แก้ไขทักษะ

source: Layers Container
th: ที่บรรจุชั้นงาน

source: Layer
th: ชั้นงาน

source: Add Layer
th: เพิ่มชั้นงาน

source: View Layer
th: เรียกดูชั้นงาน

source: Edit Children
th: แก้ไขข้อมูลของเด็ก

source: Nodes Container
th: ที่บรรจุโหนด

source: Search
th: ค้นหา

source: Node
th: โหนด

source: Add Node
th: เพิ่มโหนด

source: View Node
th: เรียกดูโหนด

source: Edit Layers
th: แก้ไขชั้นงาน

source: Edit Skill Sets
th: แก้ไขกลุ่มทักษะ

source: Import Skill Data
th: นำเข้าข้อมูลทักษะ

source: Batch Assign Skills
th: ชุดทักษะ

source: Assign Courses Skills
th: ระบุทักษะของวิชา

source: Title
th: ชื่อเรื่อง

source: ID
th: รหัส

source: ID, title, label or description
th: รหัส ชื่อเรื่อง ข้อความ หรือคำอธิบาย

source: Label
th: แถบข้อความ

source: Required
th: จำเป็น

source: Hidden
th: ซ่อน

source: Course has skills assigned already
th: วิชาได้ถูกระบุทักษะเรียบร้อยแล้วไ

source: Couldn't find a matching node
th: ไม่พบโหนดที่ตรงกันได้

source: Course attribute is empty
th: ไม่มีคุณลักษณะรายวิชา

source: Documents
th: เอกสาร

source: Document Information
th: ข้อมูลเกี่ยวกับเอกสาร

source: Submit
th: ส่งข้อมูล

source: Cancel
th: ยกเลิก

source: Document
th: เอกสาร

source: Current document hierarchy layers
th: ลำดับชั้นเอกสารปัจจุบัน

source: Available layers
th: ลำดับชั้นที่ว่าง

source: Skills Document
th: เอกสารทักษะ

source: Change information
th: เปลี่นนแปลงข้อมูล

source: No
th: ไม่

source: Yes
th: ใช่

source: Skills Documents
th: เอกสารทักษะ

source: Add Document
th: เพิ่มเอกสาร

source: View Skills Document
th: เรียกดูเอกสารทักษะ

source: Edit Layer Hierarchy
th: แก้ไขลำดับชั้น

source: View Hierarchy Layer
th: เรียกดูลำดับชั้น

source: Edit Hierarchy Layer
th: แก้ไขลำดับชั้น

source: Edit Hierarchy Layer Parents
th: แก้ไขลำดับช้นพ่อแม่

source: Layer Hierarchy
th: ลำดับชั้น

source: No Visible Projects
th: ไม่พบโครงการ

source: Enter Skills
th: กรอกทักษะ

source: No Visible Skill Sets
th: ไม่พบกลุ่มทักษะ

source: Projects
th: โครงการ

source: Project Details
th: รายละเอียดโครงการ

source: Sort by
th: เรียงตาม

source: Skill Details
th: รายละเอียดทักษะ

source: Score System Help
th: การช่วยเหลือระบบคะแนน

source: Color Codes Help
th: การช่วยเหลือเรื่องรหัสสี

source: No layer assigned
th: ไม่ระบุลำดับชั้น

source: Search Skills
th: ค้นหาทักษะ

source: Save
th: บันทึก

source: Score
th: คะแนน

source: Date
th: วันที่

source: Rating
th: จัดอันดับความพอใจ

source: Section Competencies
th: ส่วนของความสามารถ

source: Certificate of Competency
th: ประกาศนียบัตรความสามารถ

source: View
th: เรียกดู

source: Project
th: โครงการ

source: Settings
th: ตั้งค่าต่างๆ

source: New Project
th: เพิ่มโครงการใหม่

source: Edit Skill
th: แก้ไขทักษะ

source: Help
th: ช่วยเหลือ

source: Score System
th: ระบบคะแนน

source: Color Codes
th: รหัสสี

source: My Skills Grades
th: ระดับทักษะของฉัน

source: Section
th: หัวข้อย่อย

source: Term
th: ภาคเรียน

source: Year
th: ปี

source: Reports
th: รายงาน

source: Summary of a student's scores for all the skills assigned to a section.
th: สรุปผลคะแนนสำหรับทุกทักษะที่ระบุในเซกชั่น

source: Student
th: นักเรียน

source: IEP Details
th: รายละเอียดของแผนการเรียนเฉพาะบุคคล

source: Optional IEP
th: แผนการเรียนเฉพาะบุคคลสามารถยกเว้นได้

source: IEP Information
th: ข้อมูลของแผนการเรียนเฉพาะบุคคล

source: IEP
th: แผนการเรียนเฉพาะบุคคล

source: Individualized Educational Plan
th: แผนการเรียนเฉพาะบุคคล

source: Layer Information
th: ลำดับชั้นข้อมูล

source: Parents
th: ผู้ปกครอง

source: Children
th: บุตร

source: Current child layers
th: ระดับลูกปัจจุบัน

source: Available child layers
th: ระดับลูกที่ว่าง

source: Node Information
th: ข้อมูลโหนด

source: Current child nodes
th: โหนดลูกปัจจุบัน

source: Available child nodes
th: โหนดลูกที่ว่าง

source: Current node layers
th: ระดับโหนดปัจจุบัน

source: Available node layers
th: ระดับโหนดที่ว่าง

source: Current node skill sets
th: กลุ่มทักษะปัจจุบัน

source: Available node skill sets
th: กลุ่มทักษะที่ว่าง

source: Export global skills data for the school.
th: นำข้อมูลทักษะสำหรับโรงเรียนออกสู่ภายนอก

source: School
th: โรงเรียน

source: Skills Export
th: ส

source: Title, description or label
th: ชื่อเรื่อง, คำอธิบาย

source: Skill set
th: กลุ่มทักษะ

source: Submit and add
th: ส่งข้อมูล และ เพิ่มข้อมูล

source: Scroll over a skill ID to see its description here
th: ไปยัง skill ID เพื่อดูคอธิบาย

source: Skill Color Code
th: ทักษะด้านรหัสสี

source: Optional
th: ซึ่งเป็นทางเลือก

source: You must select at least one skill set.
th: คุณต้องเลือกอย่างน้อย 1 ทักษะ

source: submit-button
th: ปุ่มยอมรับ

source: cancel-button
th: ปุ่มยกเลิก

source: Remove
th: ลบออก

source: Assign Course Skills
th: ระบุทักษะรายวิชา

source: There are no skills assigned.
th: ไม่มีการระบุทักษะ

source: Edit this skill set
th: แก้ไขกลุมทักษะนี้

source: Course Matching
th: การจับคู่วิชา

source: Course attribute
th: คูณลักษณะรายวิชา

source: Select an attribute
th: เลือกคุณสมบัติ

source: Node layer
th: ระดับโหนด

source: Select a layer
th: เลือกระดับชั้น

source: Node attribute
th: ลักษณะโหนด

source: Courses not matched
th: หลักสูตรไม่ตรงกัน

source: Attribute
th: คุณลักษณะ

source: Course
th: หลักสูตร

source: Reason
th: เหตุผล

source: Courses matched
th: หลักสูตรตรงกัน

source: Assign
th: กำหนดใช้

source: Edit this Document
th: แก้ไขเอกสาร

source: Edit this skill
th: แก้ไขทักษะ

source: Visible
th: ปรากฏเห็น

source: There are no skills.
th: ไม่มีทักษะ

source: Edit this plan information
th: แก้ไขข้อมูลของแผน

source: Edit this Layer
th: แก้ไขลำดับชั้นนี้

source: Parent layers
th: ชั้นพ่อแม่

source: Child layers
th: ชั้นลูก

source: Edit children
th: แก้ไขข้อมูลนักเรียน

source: General Information
th: ข้อมูลทั่วไป

source: Edit this Node
th: แก้ไขโหนดนี้

source: Parent nodes
th: โหนดพ่อแม่

source: Child nodes
th: โหนดลูก

source: Edit child nodes
th: แก้ไขโหนดลูก

source: Edit layers
th: แก้ไขลำดับ

source: Edit skill sets
th: แก้ไขกลุ่มทักษะ

source: Reorder or Hide Projects
th: เรียงลำดับหรือซ่อนโครงการ

source: Order
th: ลำดับชั้น

source: Edit this project
th: แก้ไขโครงการนี้

source: Description
th: คำอธิบาย

source: File Type
th: ชนิดไฟล์

source: Download
th: ดาวน์โหลด

source: Reorder or Hide Skill Sets
th: เรียงลำดับหรือซ่อนกลุ่มทักษะ

source: Course Skills
th: ทักษะรายวิชา

source: Section Skills
th: กลุ่มทักษะ

source: Project1
th: โครงการ 1

source: External ID
th: รหัสจากภายนอก

source: Is skill required or optional
th: ทักษะนี้จำเป็นหรือเป็นเพียงตัวเลือก

source: Retired
th: เกษียณ

source: Skill is no longer used
th: ทักษะที่ไม่ได้ใช้นานแล้ว

source: Short label
th: ฉลากแบบสั้น

source: Full description
th: คำอธิบายแบบเต็ม

source: Scoresystem
th: ระบบแสดงคะแนน

source: The skill scoresystem.
th: ระบบคำนวณทักษะ

source: Limit to 7 characters or less.
th: จำกัดจำนวนที่ 7 ตัวอักษรหรือน้อยกว่า

source: Project deployed
th: โครงการที่นำออก

source: Skill set ID
th: รหัสกลุ้มทักษะ

source: Skill ID
th: รหัสทักษะ

source: Active
th: เปิดใช้งานอยู่

source: Course Projects
th: โครงการรายวิชา
